# GetFieldCount Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetFieldCount Method
ScheduleDefinition Class See Also
---
Gets the number of fields in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetFieldCount()
```

Visual Basic
---
```text
Public Function GetFieldCount As Integer
```

Visual C++
---
```text
public:
int GetFieldCount()
```

# ### Return Value
The number of fields.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace